Tekla.Structures.DrawingInternal.Tools.Comparer.ComparePointLists(Tekla.Structures.Drawing.PointList,Tekla.Structures.Drawing.PointList)
Compares two lists of type PointList
ReferenceList:
CompareList:
Returns: false if count of list items differs or contents of lists

Tekla.Structures.DrawingInternal.Tools.Comparer.CompareIntLists(Tekla.Structures.Drawing.IntList,Tekla.Structures.Drawing.IntList)
Compares two lists of type IntList
referenceList:
compareList:
Returns: false if count of list items differs or contents of lists

Tekla.Structures.DrawingInternal.Tools.Comparer.CompareStringLists(Tekla.Structures.Drawing.StringList,Tekla.Structures.Drawing.StringList)
Compares two lists of type StringList
referenceList:
compareList:
Returns: false if count of list items differs or contents of lists

Tekla.Structures.DrawingInternal.Tools.Comparer.CompareListElements(Tekla.Structures.Drawing.ContainerElement,Tekla.Structures.Drawing.ContainerElement)
Compares two lists of type ContainerElement
ReferenceContainer:
CompareContainer:
Returns: false if count of list items differs or contents of lists

Tekla.Structures.DrawingInternal.Tools.Comparer.AreEqual(System.Double,System.Double)
Compares two doubles using Tekla.Structures.Geometry3d.Vector.EPSILON_SQUARED as epsilon
a:
b:
Returns: true if the doubles are equal

Tekla.Structures.DrawingInternal.Tools.Comparer.AreEqual(System.Double,System.Double,System.Double)
Compares two doubles using custom epsilon
a:
b:
Epsilon:
Returns:

Tekla.Structures.DrawingInternal.Tools.Comparer.CompareDrawingObject(Tekla.Structures.Drawing.DrawingObject,Tekla.Structures.Drawing.DrawingObject,Tekla.Structures.Drawing.StringList@)
Compares the two given DrawingObjects to each other
If they contain equal values the result value is true